/* AddToDb 45
    addToDb এর কাজ হচ্ছে লোকাল স্টোরেজ cart করা id  এবং 
quantity স্টোর করতেছে যদি id টা প্রথমবার আসে তাহলে 
 সেই id প্রথমবার স্টোর হচ্ছে এবং তার কোয়ান্টিটি হচ্ছে ১ ।
আর যদি আগে থেকেই ওই id-টা থেকে থাকে তাহলে তার আগের 
quantity-র সাথে ১ যোগ করে  set করতেছি 
 */

/* 11
localStorage-এ যে ডাটা set করব সেটা হবে object ফরম্যাটে সেখানে প্রত্যেকটা product
এর id এবং quantity থাকবে 
পরবর্তীতে এই id-টার তথ্য json.file থেকে পেয়ে যাবে 
*/

/*65 
localStorage-এ ডাটা আছে কিন্তু UI-তে দেখাতে পারতেছি না । এখন UI-তে দেখাতে হলে 
getShopingCart() কে call করলে database থেকে আমরা ডাটা টাকে load করতে পারি।
কিন্তু
 getShopingCart() এটা কেমনে ব্যবহার করব, এটা একটু চিন্তা করতে হবে?? 
shop.jsx 
এর মধ্যে প্রথমবার যখন আমরা state তৈরি করতেছি,তখন সেটা থাকতেছে empty বা ফাঁকা ।
আবার cart\useState-এর মধ্যে কি রাখতেছি সেটাও চিন্তা করতে হবে । 
আমরা product add করে সেগুলাকে রাখতেছি cart\useState-এ ।

সংরক্ষণ\set করা data গুলোকে load করার জন্য side effect 
হিসেবে useEffect ব্যবহার করতে হবে 
*/